
// Приклад використання виходу з програми _exit() - миттєвий вихід із програми
#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <fcntl.h>


int main(){

  // Можна змінити параметр буферизації потоку виводу: _IONBF - без буферизації. Тоді наступне повідомлення буде виведено
  //setvbuf(stdout, NULL, _IONBF, 0);

  // Це повідомлення не видрукується
  printf("Hello word");
  // Для отримання виводу можна просунути буфер виводу перед визходом із програми.
  // fflush(stdout);
  // Вихід з програми негайно
  _exit(0);

}
