//~ В даній програмі ми визначаємо поведінку програми при надходженні сигналу SIGINT (Ctrl+C).
//~ По замовчуванню, при отриманні даного сигналу програма має завершити роботу.
//~ В нашому випадку ми налаштовуємо реакцію на отриманий сигнал signal(SIGINT, handle_int)
//~ При отриманні сигналу SIGINT буде виконана функція handle_int.
//~ В даному випадку буде видрукувано повідомлення про отримання сигналу. Програма продовжить роботу.
//~ Перевірити реакцію на сигнал можна двома способами:
//~ Виконати Ctrl+C в терміналі, де запущена програма
//~ Надіслати сигнал із іншого терміналу - kill -2 PID
//~ Переглянути список сигналів: kill -l
#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>
#include <signal.h>

//~ Функція обробник сигналу. Тут ми нічого не робимо, а просто повідомляємо про надходження сигналу
void handle_int(int sig) {
	printf("Надійшов сигнал SIGINT\n");
	//~ Якщо все ж необхідно вийти із процесу - виконайте exit() або _exit()
	//~ exit(0);
}

int main() {
	pid_t pid = getpid();
	printf("PID процесу: %d\n", pid);
	//~ Визначаємо обробник сигналу
	signal(SIGINT, handle_int);

	//~ Заставляємо процес очікувати, щоб надіслати сигнал
	printf("Процес працює...\n");
	getc(stdin);

	return 0;
}
