//~ В даному прикладі ми у функції main виділимо пам'ять динамічно під певний масив.
//~ Ця пам'ять виділиться поза стеком функції MAIN - в окремій ділянці адресного простору процесу - купі
//~ Як аргумент ми передамо потокам вказівник на цей масив - адреса першого елементу масиву
//~ Кожний потік змінить певну частину масиву
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <pthread.h>
#include <string.h>

//~ Кількість елементів масиву
#define SIZE 48

int counter = 0;
//~ Функція для роботи в потоці
void * thread_func(void *arg) {
	//~ Приведення типів
	char * array = (char *) arg;
	
	//~ Змінимо значення масиву символів. Якщо лічильник = 0, то перша половина масиву заповниться символом "2",  якщо лічильник = 1 - друга половина заповниться символом "3".
	//~ Тут "2" та "3" - ASCII символи (див. ASCII table)
	memset(array + SIZE * counter / 2, '2' + counter, SIZE / 2);
	counter++;
	
	//~ Виведемо в функції потоку адресу вказівника на масив, та адресу масиву - значення вказівника.
	//~ тут адреса вказівника відрізнятиметься від адреси вказівника у функції MAIN
	//~ тут він розташований та стеці функції потоку
	//~ Однак адреса масиву одна і та ж - він виділений в купі
	printf("У потоці: \n\tМісце розташування вказівника = %p\n\tВміст вказівника (адреса масиву) = %p\n", &array, array);
	getc(stdin);
	return NULL;
}

int main() {
	//~ Отримуємо ID процесу та друкуємо його в термінал
	pid_t init_pid = getpid();
	printf("ID процесу: %d\n", init_pid);
	
	pthread_t threads[2];

	//~ Виділяємо масив розміром SIZE * sizeof(char)... sizeof(char) = 1 Байт
	char * array = (char *) malloc(SIZE * sizeof(char));
	//~ Заповнюємо масим символом '1'
	memset(array, '1', SIZE);
	//~ Виведемо вміст масиву
	puts("Вміст масиву. Вивід в MAIN до створення потоків");
	for (int i = 0; i < SIZE; i++)
		printf("%c ", array[i]);
	puts("");
	//~ Виведемо адресу вказівника та вміст вказівника (адресу масиву)
	printf("У MAIN: \n\tМісце розташування вказівника = %p\n\tВміст вказівника (адреса масиву) = %p\n", &array, array);
	//~ Створюємо два потоки та передамо їм вказівник на масив
	pthread_create(&threads[0], NULL, thread_func, (void *) array);
	pthread_create(&threads[1], NULL, thread_func, (void *) array);

	//~ Чекаємо на завершення потоків.
	//~ Тут NULL - ми не чекаємо, що функція потоку нам щось поверне
	pthread_join(threads[0], NULL);
	pthread_join(threads[1], NULL);
	//~ Виведемо вміст масиву після змін у потоках
	puts("Вміст масиву. Вивід в MAIN по завершенню потоків");
	for (int i = 0; i < SIZE; i++)
		printf("%c ", array[i]);
	puts(" ");
	return 0;
}
